The "mysmallgrps" package currently contains construction and identification functions for groups whose order factorises into at most four prime factors.
Although all functions are called currently by their funny birthnames, they will be given more proper names if this package is released publically.
For groups of order p^4q (p, q are distinct primes), there includes only the construction function, but the identification function is under development aside and will be included once it is finished.
It should be highlighted that this package is not the most suitable for p-groups as the existing p-group generation works much efficient; it is not the most suitable for squarefree groups either, but the CGroup package developed by Heiko Dietrich and Darren Low is recommended.



As follows are some examples.

gap> p:=Random(Primes2); q:=Random(Primes2); r:=Random(Primes2); s:=Random(Primes2);
1213
1357105535093947
5749
5477

1. Comparing the counterpart function of the existing "AllSmallGroups" and "ConstructAllGroups" (from the "grpconst" package):
  Order p^2:
    gap> MySmallGroups(p^2);;time;
    3
    gap> AllSmallGroups(p^2);;time;
    2

  Order p^3:
    gap> MySmallGroups(p^3);;time;
    4
    gap> AllSmallGroups(p^3);;time;
    28

  Order p^4:
    gap> MySmallGroups(p^4);;time;
    17
    gap> AllSmallGroups(p^4);;time;
    8

  Order pq:
    gap> MySmallGroups(p*q);;time;
    2
    gap> AllSmallGroups(p*q);;time;
    Error, reached the pre-set memory limit

  Order p^2q:
    gap> MySmallGroups(p^2*q);;time;
    3
    gap> AllSmallGroups(p^2*q);;time;
    Error, reached the pre-set memory limit
    gap> ConstructAllGroups(p^2*q);;time;
    zsh: killed     ./gap

  Order p^3q:
    gap> MySmallGroups(p^3*q);;time;
    8
    gap> Size(MySmallGroups(p^3*q));
    5

  Order p^4q:
    gap> MySmallGroups(p^4*q);;time;
    30
    gap> Size(MySmallGroups(p^4*q));
    15

  Order p^2q^2:
    gap> MySmallGroups(p^2*q^2);;time;
    5
    gap> Size(MySmallGroups(p^2*q^2));
    4

  Order pqr
    gap> MySmallGroups(p*q*r);;time;
    2
    gap> AllSmallGroups(p*q*r);;time;
    Error, reached the pre-set memory limit
    # note that: gap> AllCGroups(p*q*r*s);;time;
    #  2

  Order p^2qr:
    gap> MySmallGroups(p^2*q*r);;time;
    4
    gap> Size(MySmallGroups(p^2*q*r));
    2

  Order pqrs:
    gap> MySmallGroups(p*q*r*s);;time;
    2
    # note that: gap> AllCGroups(p*q*r*s);;time;
    #  2

  For orders p^4q, although the identification function and detailed proofs for construction are still ongoing work, some examples are included here:
  gap> p:=Random(Primes2);
  1429  gap> AllSmallGroups(2^4*p);;time;
  292
  gap> MySmallGroups(2^4*p);;time;
  46

  gap> p:=Random(Primes2);
  1795918038741070627
  gap> AllSmallGroups(2^4*p);;time;
  Error, reached the pre-set memory limit
  gap> MySmallGroups(2^4*p);;time;
  42
  gap> AllSmallGroups(3^4*p);;time;
  Error, reached the pre-set memory limit

  gap> AllSmallGroups(5*11^4);
  Error, AllSmallGroups / OneGroup: groups of order 73205 not available
  gap> ConstructAllGroups(5*11^4);;time;
  324293
  gap> MySmallGroups(5*11^4);;time;
  81  

  Summary: For the extreme cases such as p-groups and squarefree groups, the "MySmallGroups" function performs not always more efficient.
  Note that for the squarefree case, the "CGroup" package is the most efficient amongst these three functions.

2. Comparing the similar function to "NumberSmallGroups":
  gap> p:=Random(Primes2); q:=Random(Primes2); r:=Random(Primes2); s:=Random(Primes2);
  4801
  5393
  6577
  4273

  Order p^2:
    gap> MyNumberOfGroups(p^2);
    2
    gap> NumberSmallGroups(p^2);
    2

  Order p^3:
    gap> MyNumberOfGroups(p^3);
    5
    gap> NumberSmallGroups(p^3);
    5

  Order p^4:
    gap> MyNumberOfGroups(p^4);
    15
    gap> NumberSmallGroups(p^4);
    15

  Order pq:
    gap> MyNumberOfGroups(p*q);
    1
    gap> NumberSmallGroups(p*q);
    1

  Order p^2q:
    gap> MyNumberOfGroups(p^2*q);
    2
    gap> NumberSmallGroups(p^2*q);
    2

  Order p^3q:
    gap> MyNumberOfGroups(p^3*q);
    5
    gap> NumberSmallGroups(p^3*q);
    Error, the library of groups of size 596795497824593 is not available

  Order p^4q:
    gap> MyNumberOfGroups(p^4*q);
    15
    gap> NumberSmallGroups(p^4*q);
    Error, the library of groups of size 2865215185055870993 is not available

  Order p^2q^2:
    gap> MyNumberOfGroups(p^2*q^2);
    4
    gap> NumberSmallGroups(p^2*q^2);
    Error, the library of groups of size 670384944754849 is not available

  Order pqr
    gap> MyNumberOfGroups(p*q*r);
    1
    gap> NumberSmallGroups(p*q*r);
    1

  Order p^2qr:
    gap> MyNumberOfGroups(p^2*q*r);
    2
    gap> NumberSmallGroups(p^2*q*r);
    Error, the library of groups of size 817563838615361 is not available

  Order pqrs:
    gap> MyNumberOfGroups(p*q*r*s);
    1
    gap> NumberSmallGroups(p*q*r*s);
    1

3. For small orders, the "compare" test is run to compare the runtime for all groups of order type available in "mysmallgrps" package and up to 10^4.
  In particular, the test calls "IdSmallGroup" function to identify all groups constructed by "MySmallGroups" and calls "MyIdSmallGroup" to identify all groups constructed by "AllSmallGroups" for the at-most-4-prime-factors types.

  isppower := x -> IsInt( x ) and x > 1 and List( Collected( FactorsInt( x ) ), i -> i[2] ) = [ 1 ] and Length( Factors ( x ) ) < 5;
  ispq := x -> IsInt( x ) and x > 1 and List( Collected( FactorsInt( x ) ), i -> i[2] ) = [1, 1];
  isp2q := x -> IsInt( x ) and x > 1 and List( Collected( FactorsInt( x ) ),i -> i[2] ) in [ [ 2, 1 ], [ 1, 2 ] ];
  isp3q := x -> IsInt( x ) and x > 1 and List( Collected( FactorsInt( x ) ),i -> i[2] ) in [ [ 3, 1 ], [ 1, 3 ] ];
  isp4q := x -> IsInt( x ) and x > 1 and List( Collected( FactorsInt( x ) ), i -> i[2] ) in [ [ 1, 4 ], [ 4, 1, ] ];
  isp2q2 := x -> IsInt( x ) and x > 1 and List( Collected( FactorsInt( x ) ), i -> i[2] ) = [ 2, 2 ];
  ispqr := x -> IsInt( x ) and x > 1 and List( Collected( FactorsInt( x ) ), i -> i[2] ) = [1, 1, 1];
  isp2qr := x -> IsInt( x ) and x > 1 and List( Collected( FactorsInt( x ) ),i -> i[2] ) in [ [ 1, 1, 2 ], [ 1, 2, 1 ], [2, 1, 1] ];
  ispqrs := x -> IsInt( x ) and x > 1 and List( Collected( FactorsInt( x ) ), i -> i[2] ) = [1, 1, 1, 1];


  elppower := Filtered([1..10000], x -> isppower(x));;
  elpq := Filtered([1..10000], x -> ispq(x));;
  elp2q := Filtered([1..10000], x -> isp2q(x));;
  elp3q := Filtered([1..10000], x -> isp3q(x));;
  elp4q := Filtered([1..10000], x -> isp4q(x));;
  elp2q2 := Filtered([1..10000], x -> isp2q2(x));;
  elpqr := Filtered([1..10000], x -> ispqr(x));;
  elp2qr := Filtered([1..10000], x -> isp2qr(x));;
  elpqrs := Filtered([1..10000], x -> ispqrs(x));;

  compare := function( list )
  local nums, grps, ids, tm, tg, tim, tgi, ids2, grg, grm, tgm;

     nums:= Sum(List(list,NumberSmallGroups));
     Print("there are ",nums," groups \n");
     if not Sum(list,MyNumberOfGroups) = nums then Error("number not correct"); fi;
     tg  := Runtime();
     grg := List(list,x->AllSmallGroups(x));
     tg  := Runtime()-tg;
     Print("GAP construction: ",tg,"\n");
     tm  := Runtime();
     grm := List(list,x->MySmallGroups(x));
     tm  := Runtime()-tm;
     Print("my construction: ",tm,"\n");
     tgi := Runtime();
     ids := List(Flat(grm),IdSmallGroup);
     tgi := Runtime()-tgi;
     Print("gaps ID: ",tgi,"\n");
     tgm := Runtime();
     ids2 := List(Flat(grg),MyIdSmallGroup);
     tgm := Runtime()-tgm;
     Print("my ID: ",tgm,"\n");
     if not IsDuplicateFreeList(ids) then Error("our group ids"); fi;
     if not IsDuplicateFreeList(ids2) then Error("our id function"); fi;
     return [nums,tg,tm,tgi,tgm];
  end;

  gap> compare(elppower);
  there are 1229 groups
  GAP construction: 308
  my construction: 478
  gaps ID: 25
  my ID: 51
  [ 1229, 308, 478, 25, 51 ]

  gap> compare(elpq);
  there are 3652 groups
  GAP construction: 5102
  my construction: 1850
  gaps ID: 65
  my ID: 75
  [ 3652, 5102, 1850, 65, 75 ]

  gap> compare(elp2q);
  there are 2816 groups
  GAP construction: 3947
  my construction: 1563
  gaps ID: 5225
  my ID: 3951
  [ 2816, 3947, 1563, 5225, 3951 ]

  gap> compare(elp3q);
  Error, the library of groups of size 2662 is not available
  Note that for order type p^3q the SmallGroupLibrary does not cover groups of order greater than 2500, so the list of orders has to be reduced in order for compare to run:
  gap> elp3q := Filtered([1..2500], x->isp3q(x));  compare(elp3q);;
  gap> compare(elp3q);
  there are 1138 groups
  GAP construction: 1257
  my construction: 734
  gaps ID: 2186
  my ID: 1795
  [ 1138, 1257, 734, 2186, 1795 ]

  gap> compare(elpqr);
  there are 6065 groups
  GAP construction: 6401
  my construction: 3730
  gaps ID: 4654
  my ID: 4031
  [ 6065, 6401, 3730, 4654, 4031 ]

  gap> compare(elp2qr);
  there are 10063 groups
  GAP construction: 283543
  my construction: 7031
  gaps ID: 214308
  my ID: 27149
  [ 10063, 283543, 7031, 214308, 27149 ]

  Summary: Again, the overall performance for p-groups of the "mysmallgrps" package is slightly less efficient than the existing SmallGroupLibrary.
  For all other order types the construction function "MySmallGroups" performs always better, especially for orders p^2qr.
  The identification function "MyIdSmallGroup" is most of the time more efficient than "IdSmallGroup".

  For orders p^4q, since our identification is still under development, only a comparison of construction runtime can be made:
  compareconst := function( list )
  local nums, grps, ids, tm, tg, tim, tgi, ids2, grg, grm, tgm;

     nums:= Sum(List(list,NumberSmallGroups));
     Print("there are ",nums," groups \n");
     if not Sum(list,MyNumberOfGroups) = nums then Error("number not correct"); fi;
     tg  := Runtime();
     grg := List(list,x->AllSmallGroups(x));
     tg  := Runtime()-tg;
     Print("GAP construction: ",tg,"\n");
     tm  := Runtime();
     grm := List(list,x->MySmallGroups(x));
     tm  := Runtime()-tm;
     Print("my construction: ",tm,"\n");
     tgi := Runtime();
     return [nums,tg,tm];
  end;

  gap> compareconst(elp4q);
  there are 6565 groups
  GAP construction: 13500
  my construction: 5850
  [ 6565, 13500, 5850 ]

  It is observed that the construction by "MySmallGroups" takes only half of the time than "AllSmallGroups".

4. For some small orders that are not available in SmallGroupLibrary, the "ConstructAllGroups" is called to compare runtime of "MySmallGroups" by the following function.

  comparegrpconst := function( list )
  local nums, grps, grpconst, tm, tg, tim, tgi, ids2, grg, grm, tgm;

     nums:= Sum(list,MyNumberOfGroups);
     Print("there are ",nums," groups \n");
     tg  := Runtime();
     grg := List(list,x -> ConstructAllGroups(x));
     tg  := Runtime()-tg;
     Print("GAP construction: ",tg,"\n");
     tm  := Runtime();
     grm := List(list,x->MySmallGroups(x));
     tm  := Runtime()-tm;
     Print("my construction: ",tm,"\n");
     tgi := Runtime();
     if not Sum(List(grg, x->Size(x))) = nums then Error("number not correct"); fi;
     return [nums,tg,tm];
  end;

  elp3q := Filtered([1..10000], x -> isp3q(x));;

  gap> comparegrpconst(elp3q);
  there are 3708 groups
  GAP construction: 164322
  my construction: 3005
  [ 3708, 164322, 3005 ]

  It is noted that SmallGroupLibrary does not cover orders of the form p^2q^2 greater than 50000, so a similar test is run for such orders up to 10^5 to compare "MySmallGroups" with "ConstructAllGroups".

  elp2q2 := Filtered([50000..100000], x -> isp2q2(x));;

  gap> comparegrpconst(elp2q2);
  there are 255 groups
  GAP construction: 232654
  my construction: 164
  [ 255, 232654, 164 ]
